Tekla Open API Reference for Tekla Structures 2025
LineSegment.GetDirectionVector Method
 Returns a new unit direction vector of a line segment.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector GetDirectionVector()
Public Function GetDirectionVector As Vector
Return Value
Type: Vector
The unit direction vector of the line segment.
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace